/**
 * Y.CarIdTranslator
 * @description 车牌号前缀转换器
 * @author huya.nzb@taobao.com
 * @date 2013-03-02
 * @version 0.0.1
 */
YUI.add('caridtranslator', function(Y) {
 
/**
 * 车牌号前缀转换器
 * @module caridtranslator
 */

	/**
	 * 车牌号前缀转换器
	 * @class CarIdTranslator
	 * @param {Object} data 城市与车牌前缀对应对象
	 * @constructor
	 */ 
    function CarIdTranslator(data) {
        this._data = data || {};
        this._memory = {};
    }
    
	/**
	 * 转换
	 * @method translate
	 * @public
	 */ 
    CarIdTranslator.prototype.translate = function(query) {
        var prefix = this._memory[query] || this._data[query];
        
        if (!prefix) {
            for (var k in this._data) {
                if (this._data.hasOwnProperty(k) && query.indexOf(k) > -1) {
                    prefix = this._memory[query] = this._data[k];
                    break;
                }
            }
        }
        
        return prefix || '';
    };
    
	/**
	 * 城市与车牌前缀对象
	 * @property Data
	 * @static
	 */
    CarIdTranslator.Data = {"北京":"京","上海":'沪',"天津":"津","重庆":"渝","石家庄":"冀A","唐山":"冀B","秦皇岛":"冀C","邯郸":"冀D","邢台":"冀E","保定":"冀F","张家口":"冀G","承德":"冀H","沧州":"冀J","廊坊":"冀R","衡水":"冀T","郑州":"豫A","开封":"豫B","洛阳":"豫C","平顶山":"豫D","安阳":"豫E","鹤壁":"豫F","新乡":"豫G","焦作":"豫H","濮阳":"豫J","许昌":"豫K","漯河":"豫L","三门峡":"豫M","商丘":"豫N","周口":"豫P","驻马店":"豫Q","南阳":"豫R","信阳":"豫S","济源":"豫U","昆明":"云A","东川":"云B","昭通":"云C","曲靖":"云D","楚雄":"云E","玉溪":"云F","红河":"云G","文山":"云H","思茅":"云J","大理":"云L","西双版纳":"云K","保山":"云M","德宏":"云N","丽江":"云P","怒江":"云Q","迪庆":"云R","临沧":"云S","沈阳":"辽A","大连":"辽B","鞍山":"辽C","抚顺":"辽D","本溪":"辽E","丹东":"辽F","锦州":"辽G","营口":"辽H","阜新":"辽J","辽阳":"辽K","盘锦":"辽L","铁岭":"辽M","朝阳":"辽N","葫芦岛":"辽P","哈尔滨":"黑A","齐齐哈尔":"黑B","牡丹江":"黑C","佳木斯":"黑D","大庆":"黑E","伊春":"黑F","鸡西":"黑G","鹤岗":"黑H","双鸭山":"黑J","七台河":"黑K","绥化":"黑M","黑河":"黑N","大兴安岭":"黑P","长沙":"湘A","株洲":"湘B","湘潭":"湘C","衡阳":"湘D","邵阳":"湘E","岳阳":"湘F","大庸":"湘G","益阳":"湘H","常德":"湘J","娄底":"湘K","郴州":"湘L","零陵":"湘M","怀化":"湘N","湘西":"湘P","合肥":"皖A","芜湖":"皖B","蚌埠":"皖C","淮南":"皖D","马鞍山":"皖E","淮北":"皖F","铜陵":"皖G","安庆":"皖H","黄山":"皖J","阜阳":"皖K","宿州":"皖L","滁州":"皖M","六安":"皖N","宣城":"皖P","巢湖":"皖Q","池州":"皖R","济南":"鲁A","青岛":"鲁B","淄博":"鲁C","枣庄":"鲁D","东营":"鲁E","烟台":"鲁F","潍坊":"鲁G","济宁":"鲁H","泰安":"鲁J","威海":"鲁K","日照":"鲁L","莱芜":"鲁M","德州":"鲁N","聊城":"鲁P","临沂":"鲁Q","荷泽":"鲁R","乌鲁木齐":"新A","昌吉":"新B","石河子":"新C","奎屯":"新D","博尔塔拉":"新E","伊犁哈萨":"新F","塔城":"新G","阿勒泰":"新H","克拉玛依":"新J","吐鲁番":"新K","哈密":"新L","巴音郭愣":"新M","阿克苏":"新N","克孜勒苏柯":"新P","喀什":"新Q","和田":"新R","南京":"苏A","无锡":"苏B","徐州":"苏C","常州":"苏D","苏州":"苏E","南通":"苏F","连云港":"苏G","淮阴":"苏H","盐城":"苏J","扬州":"苏K","镇江":"苏L","泰州":"苏M","宿迁":"苏N","杭州":"浙A","宁波":"浙B","温州":"浙C","绍兴":"浙D","湖州":"浙E","嘉兴":"浙F","金华":"浙G","衢州":"浙H","台州":"浙J","丽水":"浙K","舟山":"浙L","南昌":"赣A","赣州":"赣B","宜春":"赣C","吉安":"赣D","上饶":"赣E","抚州":"赣F","九江":"赣G","景德镇":"赣H","萍乡":"赣J","新余":"赣K","鹰潭":"赣L","武汉":"鄂A","黄石":"鄂B","十堰":"鄂C","沙市":"鄂D","宜昌":"鄂E","襄樊":"鄂F","鄂州":"鄂G","荆门":"鄂H","黄岗":"鄂J","孝感":"鄂K","咸宁":"鄂L","荆州":"鄂M","郧阳":"鄂N","宜昌":"鄂P","鄂西":"鄂Q","南宁":"桂A","柳州":"桂B","桂林":"桂C","梧州":"桂D","北海":"桂E","南宁":"桂F","柳州":"桂G","桂林":"桂H","梧州":"桂J","玉林":"桂K","河池":"桂M","百色":"桂L","钦州":"桂N","防城":"桂P","兰州":"甘A","嘉峪关":"甘B","金昌":"甘C","白银":"甘D","天水":"甘E","酒泉":"甘F","张掖":"甘G","武威":"甘H","定西":"甘J","陇南":"甘K","平凉":"甘L","庆阳":"甘M","临夏":"甘N","甘南":"甘P","太原":"晋A","大同":"晋B","阳泉":"晋C","长治":"晋D","晋城":"晋E","朔州":"晋F","雁北":"晋G","忻州":"晋H","吕梁":"晋J","晋中":"晋K","临汾":"晋L","运城":"晋M","呼和浩特":"蒙A","包头":"蒙B","乌海":"蒙C","赤峰":"蒙D","呼伦贝尔":"蒙E","兴安":"蒙F","锡林郭勒":"蒙G","乌兰察布":"蒙H","伊克昭盟":"蒙J","巴彦淖尔":"蒙K","阿拉善":"蒙L","西安":"陕A","铜川":"陕B","宝鸡":"陕C","威阳":"陕D","渭南":"陕E","汉中":"陕F","安康":"陕G","商洛":"陕H","延安":"陕J","榆林":"陕K","长春":"吉A","吉林":"吉B","四平":"吉C","辽源":"吉D","通化":"吉E","白山":"吉F","白城":"吉G","延边":"吉H","福州":"闽A","莆田":"闽B","泉州":"闽C","厦门":"闽D","漳州":"闽E","龙岩":"闽F","三明":"闽G","南平":"闽H","宁德":"闽J","贵阳":"贵A","六盘水":"贵B","遵义":"贵C","铜仁":"贵D","黔西南":"贵E","毕节":"贵F","安顺":"贵G","黔东南":"贵H","黔南":"贵J","广州":"粤A","深圳":"粤B","珠海":"粤C","汕头":"粤D","佛山":"粤E","韶关":"粤F","湛江":"粤G","肇庆":"粤H","江门":"粤J","茂名":"粤K","惠州":"粤L","梅州":"粤M","汕尾":"粤N","河源":"粤P","阳江":"粤Q","清远":"粤R","东莞":"粤S","中山":"粤T","潮州":"粤U","揭阳":"粤V","云浮":"粤W","顺德":"粤X","南海":"粤Y","西宁":"青A","海东":"青B","海北":"青C","黄南":"青D","海南":"青E","果洛":"青F","玉树":"青G","海西":"青H","拉萨":"藏A","昌都":"藏B","山南":"藏C","日喀则":"藏D","那曲":"藏E","阿里":"藏F","林芝":"藏G","成都":"川A","绵阳":"川B","自贡":"川C","攀枝花":"川D","泸州":"川E","德阳":"川F","广元":"川H","遂宁":"川J","内江":"川K","乐山":"川L","宜宾":"川Q","南充":"川R","达县":"川S","雅安":"川T","阿坝":"川U","甘孜":"川V","凉山":"川W","银川":"宁A","石嘴山":"宁B","银南":"宁C","固原":"宁D","海口":"琼A","三亚":"琼B","琼北":"琼C"}
	
    Y.CarIdTranslator = CarIdTranslator;
    
}, '0.0.1', {
    requires: []    
});
